Table of Contents
 Class GrpcMessage
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public sealed class GrpcMessage : IMessage<GrpcMessage>, IEquatable<GrpcMessage>, IDeepCloneable<GrpcMessage>, IBufferMessage, IMessage
Inheritance
object
GrpcMessage
Implements
IMessage<GrpcMessage>
IEquatable<GrpcMessage>
IDeepCloneable<GrpcMessage>
IBufferMessage
IMessage
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Constructors
 GrpcMessage()
public GrpcMessage()
 GrpcMessage(GrpcMessage)
public GrpcMessage(GrpcMessage other)
Parameters
other GrpcMessage
Fields
 BufferFieldNumber
Field number for the "buffer" field.
public const int BufferFieldNumber = 7
Field Value
int
 ClientIdFieldNumber
Field number for the "clientId" field.
public const int ClientIdFieldNumber = 3
Field Value
int
 CompressionFieldNumber
Field number for the "compression" field.
public const int CompressionFieldNumber = 8
Field Value
int
 DataFieldNumber
Field number for the "data" field.
public const int DataFieldNumber = 2
Field Value
int
 DataTypeFieldNumber
Field number for the "dataType" field.
public const int DataTypeFieldNumber = 5
Field Value
int
 MessageNameFieldNumber
Field number for the "messageName" field.
public const int MessageNameFieldNumber = 1
Field Value
int
 MessageTypeFieldNumber
Field number for the "messageType" field.
public const int MessageTypeFieldNumber = 6
Field Value
int
 OperationIdFieldNumber
Field number for the "operationId" field.
public const int OperationIdFieldNumber = 4
Field Value
int
Properties
 Buffer
public ByteString Buffer { get; set; }
Property Value
ByteString
 ClientId
public string ClientId { get; set; }
Property Value
string
 Compression
public bool Compression { get; set; }
Property Value
bool
 Data
public string Data { get; set; }
Property Value
string
 DataType
public string DataType { get; set; }
Property Value
string
 Descriptor
public static MessageDescriptor Descriptor { get; }
Property Value
MessageDescriptor
 MessageName
public string MessageName { get; set; }
Property Value
string
 MessageType
public GrpcMessage.Types.MessageType MessageType { get; set; }
Property Value
GrpcMessage.Types.MessageType
 OperationId
public string OperationId { get; set; }
Property Value
string
 Parser
public static MessageParser<GrpcMessage> Parser { get; }
Property Value
MessageParser<GrpcMessage>
Methods
 CalculateSize()
Calculates the size of this message in Protocol Buffer wire format, in bytes.
public int CalculateSize()
Returns
int
The number of bytes required to write this message to a coded output stream.
 Clone()
Creates a deep clone of this object.
public GrpcMessage Clone()
Returns
GrpcMessage
A deep clone of this object.
 Equals(GrpcMessage)
Indicates whether the current object is equal to another object of the same type.
public bool Equals(GrpcMessage other)
Parameters
other GrpcMessage
An object to compare with this object.
Returns
bool
true if the current object is equal to the other parameter; otherwise, false.
 Equals(object)
Determines whether the specified object is equal to the current object.
public override bool Equals(object other)
Parameters
other object
Returns
bool
true if the specified object is equal to the current object; otherwise, false.
 GetHashCode()
Serves as the default hash function.
public override int GetHashCode()
Returns
int
A hash code for the current object.
 MergeFrom(CodedInputStream)
Merges the data from the specified coded input stream with the current message.
public void MergeFrom(CodedInputStream input)
Parameters
input CodedInputStream
Remarks
See the user guide for precise merge semantics.
 MergeFrom(GrpcMessage)
Merges the given message into this one.
public void MergeFrom(GrpcMessage other)
Parameters
other GrpcMessage
Remarks
See the user guide for precise merge semantics.
 ToString()
Returns a string that represents the current object.
public override string ToString()
Returns
string
A string that represents the current object.
 WriteTo(CodedOutputStream)
Writes the data to the given coded output stream.
public void WriteTo(CodedOutputStream output)
Parameters
output CodedOutputStream
Coded output stream to write the data to. Must not be null.
 Edit this page